Documents/ИА_ПланПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ПланПродаж</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланУтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходныйПлан</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Неделя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ИсточникиОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Неделя</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ИсточникиОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИА_ПланПродаж/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ИА_ИсходныйПланПродаж.Очистить();
	Движения.ИА_ОткорректированныйПланПродаж.Очистить();
	
	Для каждого стр из ИсходныйПлан Цикл
		Новстр = Движения.ИА_ИсходныйПланПродаж.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
		Новстр.Период = стр.Неделя;
		Новстр.Организация = Организация;
	КонецЦикла;
	
	Для каждого стр из План Цикл
		Если стр.Сумма>0 ИЛИ стр.Факт>0 Тогда
			Новстр = Движения.ИА_ОткорректированныйПланПродаж.Добавить();
			ЗаполнитьЗначенияСвойств(Новстр, стр);
			Новстр.Период = Дата;
			Новстр.НаМесяц = НаМесяц;
			Новстр.Номер = стр.НомерСтроки;
			Новстр.Организация = Организация;
		КонецЕсли;
	КонецЦикла;

	Движения.ИА_ИсходныйПланПродаж.Записать();
	Движения.ИА_ОткорректированныйПланПродаж.Записать();
КонецПроцедуры

Функция Печать(ИмяМакета, СтруктураНедель, ВыбраннаяНеделя) Экспорт
	
	Если ИмяМакета = СокрЛП("ИА_ПланПродажПоКонтрагентам") Тогда
		Возврат ПечатьПланПродажПоКонтрагентам(СтруктураНедель, ВыбраннаяНеделя);
	ИначеЕсли ИмяМакета = СокрЛП("ИА_ПланПродажПоПродуктам") Тогда
		Возврат ПечатьПланПродажПоПродуктам(СтруктураНедель, ВыбраннаяНеделя);
	ИначеЕсли ИмяМакета = СокрЛП("ИА_КоррекцияПланаПродажПоКонтрагентам") Тогда
		Возврат ПечатьКоррекцияПланаПродажПоКонтрагентам(СтруктураНедель, ВыбраннаяНеделя);
	ИначеЕсли ИмяМакета = СокрЛП("ИА_КоррекцияПланаПродажПоПродуктам") Тогда
		Возврат ПечатьКоррекцияПланаПродажПоПродуктам(СтруктураНедель, ВыбраннаяНеделя);
	КонецЕсли;	
	
КонецФункции

Функция ПечатьПланПродажПоПродуктам(СтруктураНедель, ВыбраннаяНеделя)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.ИА_ПланПродаж.ПолучитьМакет("ИА_ПланПродажПоПродуктам");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Ссылка) КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ИА_ПланПродажПлан.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И ИА_ПланПродажПлан.Сумма <> 0
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Контрагент)
		|	КОНЕЦ КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Продукт) КАК Продукт,
		|	ИА_ПланПродажПлан.Сумма КАК Сумма,
		|	ИА_ПланПродажПлан.Действия,
		|	ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Источник) КАК Источник,
		|	ИА_ПланПродажПлан.Неделя КАК Неделя
		|ИЗ
		|	Документ.ИА_ПланПродаж.ИсходныйПлан КАК ИА_ПланПродажПлан
		|ГДЕ
		|	ИА_ПланПродажПлан.Ссылка = &Ссылка
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Неделя
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	ИА_ПланПродажПлан.Продукт";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ВыбраннаяНеделя <> "Весь месяц"	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИА_ПланПродажПлан.Неделя = &Неделя");
		Запрос.УстановитьПараметр("Неделя", ВыбраннаяНеделя);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьПродукт = Макет.ПолучитьОбласть("Продукт");
	ОбластьПромежуточныйИтог = Макет.ПолучитьОбласть("ПромежуточныйИтог");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	 	
	ВыборкаПродукт = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПродукт.Следующий() Цикл
		ОбластьПродукт.Параметры.Заполнить(ВыборкаПродукт);
		ТабДок.Вывести(ОбластьПродукт, ВыборкаПродукт.Уровень());
	    ОбластьПромежуточныйИтог.Параметры.Заполнить(ВыборкаПродукт);
		ВыборкаДетальныеЗаписи = ВыборкаПродукт.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьДетальныхЗаписей.Параметры.НомерНедели = СтруктураНедель.Получить(ВыборкаДетальныеЗаписи.Неделя);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПромежуточныйИтог, ВыборкаПродукт.Уровень());
		ТабДок.Вывести(ОбластьПодвал);
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьОбщийИтог, ВыборкаОбщийИтог.Уровень());
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции	

Функция ПечатьПланПродажПоКонтрагентам(СтруктураНедель, ВыбраннаяНеделя)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.ИА_ПланПродаж.ПолучитьМакет("ИА_ПланПродажПоКонтрагентам");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ПланПродажПлан.Неделя КАК Неделя,
		|	ВЫБОР
		|		КОГДА ИА_ПланПродажПлан.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И ИА_ПланПродажПлан.Сумма <> 0
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Контрагент)
		|	КОНЕЦ КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Продукт),
		|	ИА_ПланПродажПлан.Сумма КАК Сумма,
		|	ИА_ПланПродажПлан.Действия,
		|	ПРЕДСТАВЛЕНИЕ(ИА_ПланПродажПлан.Источник)
		|ИЗ
		|	Документ.ИА_ПланПродаж.ИсходныйПлан КАК ИА_ПланПродажПлан
		|ГДЕ
		|	ИА_ПланПродажПлан.Ссылка = &Ссылка
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Неделя
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	Неделя";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ВыбраннаяНеделя <> "Весь месяц"	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИА_ПланПродажПлан.Неделя = &Неделя");
		Запрос.УстановитьПараметр("Неделя", ВыбраннаяНеделя);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНеделя = Макет.ПолучитьОбласть("Неделя");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	
	ВыборкаНеделя = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНеделя.Следующий() Цикл
		ОбластьНеделя.Параметры.Заполнить(ВыборкаНеделя);
		ОбластьНеделя.Параметры.НомерНедели = СтруктураНедель.Получить(ВыборкаНеделя.Неделя);
		ВыборкаДетальныеЗаписи = ВыборкаНеделя.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьНеделя, ВыборкаНеделя.Уровень());
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//ТабДок.Вывести(ОбластьПодвалТаблицы); 
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьОбщийИтог);
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьКоррекцияПланаПродажПоПродуктам(СтруктураНедель, ВыбраннаяНеделя)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.ИА_КоррекцияПланаПродаж.ПолучитьМакет("ИА_КоррекцияПланаПродажПоПродуктам");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Ссылка) КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ИА_КоррекцияПланаПродажПлан.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И ИА_КоррекцияПланаПродажПлан.Сумма <> 0
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Контрагент)
		|	КОНЕЦ КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Продукт) КАК Продукт,
		|	ИА_КоррекцияПланаПродажПлан.Сумма КАК СуммаПлан,
		|	ИА_КоррекцияПланаПродажПлан.Действия,
		|	ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Источник) КАК Источник,
		|	ИА_КоррекцияПланаПродажПлан.Неделя КАК Неделя,
		|	ИА_КоррекцияПланаПродажПлан.Факт КАК СуммаФакт,
		|	ИА_КоррекцияПланаПродажПлан.Сумма - ИА_КоррекцияПланаПродажПлан.Факт КАК СуммаОтклонение
		|ИЗ
		|	Документ.ИА_ПланПродаж.План КАК ИА_КоррекцияПланаПродажПлан
		|ГДЕ
		|	ИА_КоррекцияПланаПродажПлан.Ссылка = &Ссылка
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Неделя
		|ИТОГИ
		|	СУММА(СуммаПлан),
		|	СУММА(СуммаФакт),
		|	СУММА(СуммаОтклонение)
		|ПО
		|	ОБЩИЕ,
		|	ИА_КоррекцияПланаПродажПлан.Продукт";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если ВыбраннаяНеделя <> "Весь месяц"	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИА_КоррекцияПланаПродажПлан.Неделя = &Неделя");
		Запрос.УстановитьПараметр("Неделя", ВыбраннаяНеделя);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьПродукт = Макет.ПолучитьОбласть("Продукт");
	ОбластьПромежуточныйИтог = Макет.ПолучитьОбласть("ПромежуточныйИтог");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	 	
	ВыборкаПродукт = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПродукт.Следующий() Цикл
		ОбластьПродукт.Параметры.Заполнить(ВыборкаПродукт);
		ТабДок.Вывести(ОбластьПродукт, ВыборкаПродукт.Уровень());
	    ОбластьПромежуточныйИтог.Параметры.Заполнить(ВыборкаПродукт);
		ВыборкаДетальныеЗаписи = ВыборкаПродукт.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьДетальныхЗаписей.Параметры.НомерНедели = СтруктураНедель.Получить(ВыборкаДетальныеЗаписи.Неделя);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПромежуточныйИтог, ВыборкаПродукт.Уровень());
		ТабДок.Вывести(ОбластьПодвал);
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//ТабДок.Вывести(ОбластьПодвалТаблицы);
	
	ТабДок.Вывести(ОбластьОбщийИтог);
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции	

Функция ПечатьКоррекцияПланаПродажПоКонтрагентам(СтруктураНедель, ВыбраннаяНеделя)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Документы.ИА_КоррекцияПланаПродаж.ПолучитьМакет("ИА_КоррекцияПланаПродажПоКонтрагентам");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_КоррекцияПланаПродажПлан.Неделя КАК Неделя,
		|	ВЫБОР
		|		КОГДА ИА_КоррекцияПланаПродажПлан.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И ИА_КоррекцияПланаПродажПлан.Сумма <> 0
		|			ТОГДА ""Прочие""
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Контрагент)
		|	КОНЕЦ КАК КонтрагентПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Продукт),
		|	ИА_КоррекцияПланаПродажПлан.Сумма КАК СуммаПлан,
		|	ИА_КоррекцияПланаПродажПлан.Действия,
		|	ПРЕДСТАВЛЕНИЕ(ИА_КоррекцияПланаПродажПлан.Источник),
		|	ИА_КоррекцияПланаПродажПлан.Факт КАК СуммаФакт,
		|	ИА_КоррекцияПланаПродажПлан.Сумма - ИА_КоррекцияПланаПродажПлан.Факт КАК СуммаОтклонение
		|ИЗ
		|	Документ.ИА_ПланПродаж.План КАК ИА_КоррекцияПланаПродажПлан
		|ГДЕ
		|	ИА_КоррекцияПланаПродажПлан.Ссылка = &Ссылка
		|	И 1 = 1
		|
		|УПОРЯДОЧИТЬ ПО
		|	Неделя
		|ИТОГИ
		|	СУММА(СуммаПлан),
		|	СУММА(СуммаФакт),
		|	СУММА(СуммаОтклонение)
		|ПО
		|	ОБЩИЕ,
		|	Неделя";
		
		
	Если ВыбраннаяНеделя <> "Весь месяц"	Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ИА_КоррекцияПланаПродажПлан.Неделя = &Неделя");
		Запрос.УстановитьПараметр("Неделя", ВыбраннаяНеделя);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьНеделя = Макет.ПолучитьОбласть("Неделя");
	ОбластьОбщийИтог = Макет.ПолучитьОбласть("ОбщиеИтоги");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
	
	ВыборкаНеделя = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНеделя.Следующий() Цикл
		ОбластьНеделя.Параметры.Заполнить(ВыборкаНеделя);
		ОбластьНеделя.Параметры.НомерНедели = СтруктураНедель.Получить(ВыборкаНеделя.Неделя);
		ВыборкаДетальныеЗаписи = ВыборкаНеделя.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьНеделя, ВыборкаНеделя.Уровень());
		ТабДок.Вывести(ОбластьПодвал);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	ТабДок.Вывести(ОбластьОбщийИтог);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции
